app/Controllers/AuthController.php

    public function processLogin()
    {
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM "users"
WHERE "email" = 'max.galmant@gmail.com'
 LIMIT 1

    public function processRegister()
    {
        $model = new UserModel();
        $data = [
            'email' => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ];

        $model->save($data);
---
INSERT INTO "users" ("email", "password") VALUES ('max.galmant@gmail.com', '$2y$10$td3ZSYqNapoG3blUHZH6d.l4cSrt5afX5kkqsChPHKEcREe9mae3y')