app/Controllers/DashboardController.php

SELECT *
FROM "tasks"
WHERE "usr_id" = '1'
---
    public function index()
    {
        $model = new TaskModel();
        $tasks = $model->where('usr_id', session()->get('user_id'))->findAll();