app/Controllers/TaskController.php

INSERT INTO "tasks" ("usr_id", "title", "description", "due_date") VALUES ('1', 'Oral', 'Oral de sae ', '2024-11-28')
---
    public function store()
    {
        $model = new TaskModel();
        $data = [
            'usr_id' => session()->get('user_id'),
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'due_date' => $this->request->getPost('due_date'),
        ];

        $model->save($data);